HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSrc_regdef.h
/** \\brief  EMEM Service requests */
typedef volatile struct _Ifx_SRC_EMEM
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, Emulation Memory Service Request */
} Ifx_SRC_EMEM;

/** \\brief  ERAY Service requests */
typedef volatile struct _Ifx_SRC_ERAY
{
    Ifx_SRC_SRCR INT[2];                    /**< \brief 0, E-RAY Service Request */
    Ifx_SRC_SRCR TINT[2];                   /**< \brief 8, E-RAY Timer Interrupt Service Request */
    Ifx_SRC_SRCR NDAT[2];                   /**< \brief 10, E-RAY New Data Service Request */
    Ifx_SRC_SRCR MBSC[2];                   /**< \brief 18, E-RAY Message Buffer Status Changed Service Request */
    Ifx_SRC_SRCR OBUSY;                     /**< \brief 20, E-RAY Output Buffer Busy Service Request */
    Ifx_SRC_SRCR IBUSY;                     /**< \brief 24, E-RAY Input Buffer Busy Service Request */
    unsigned char reserved_28[40];          /**< \brief 28, \internal Reserved */
} Ifx_SRC_ERAY;

/** \\brief  ETH Service requests */
typedef volatile struct _Ifx_SRC_ETH
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, Ethernet Service Request */
} Ifx_SRC_ETH;

/** \\brief  FCE Service requests */
typedef volatile struct _Ifx_SRC_FCE
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, FCE Error Service Request */
} Ifx_SRC_FCE;

/** \\brief  GPSR Service requests */
typedef volatile struct _Ifx_SRC_GPSR
{
    Ifx_SRC_SRCR SR0;                       /**< \brief 0, General Purpose Service Request 0 */
    Ifx_SRC_SRCR SR1;                       /**< \brief 4, General Purpose Service Request 1 */
    Ifx_SRC_SRCR SR2;                       /**< \brief 8, General Purpose Service Request 2 */
    Ifx_SRC_SRCR SR3;                       /**< \brief C, General Purpose Service Request 3 */
    unsigned char reserved_10[16];          /**< \brief 10, \internal Reserved */
} Ifx_SRC_GPSR;

/** \\brief  GPT12 Service requests */
typedef volatile struct _Ifx_SRC_GPT12
{
    Ifx_SRC_SRCR CIRQ;                      /**< \brief 0, GPT12 CAPREL Service Request */
    Ifx_SRC_SRCR T2;                        /**< \brief 4, GPT12 T2 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T3;                        /**< \brief 8, GPT12 T3 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T4;                        /**< \brief C, GPT12 T4 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T5;                        /**< \brief 10, GPT12 T5 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T6;                        /**< \brief 14, GPT12 T6 Overflow/Underflow Service Request */
} Ifx_SRC_GPT12;

/** \\brief  GTM Service requests */
typedef volatile struct _Ifx_SRC_GTM
{
    Ifx_SRC_SRCR AEIIRQ;                    /**< \brief 0, GTM AEI Shared Service Request */
    Ifx_SRC_SRCR ARUIRQ[3];                 /**< \brief 4, GTM ARU Shared Service Request */
    unsigned char reserved_10[4];           /**< \brief 10, \internal Reserved */
    Ifx_SRC_SRCR BRCIRQ;                    /**< \brief 14, GTM BRC Shared Service Request */
    Ifx_SRC_SRCR CMPIRQ;                    /**< \brief 18, GTM CMP Shared Service Request */
    Ifx_SRC_SRCR SPEIRQ[2];                 /**< \brief 1C, GTM SPE Shared Service Request */
    Ifx_SRC_SRCR PSM[1][8];                 /**< \brief 24, GTM PSM Shared Service Request */
    unsigned char reserved_44[96];          /**< \brief 44, \internal Reserved */
    Ifx_SRC_SRCR DPLL[27];                  /**< \brief A4, GTM DPLL Service Request */
    unsigned char reserved_110[112];        /**< \brief 110, \internal Reserved */
    Ifx_SRC_SRCR TIM[4][8];                 /**< \brief 180, GTM TIM Shared Service Request */
    unsigned char reserved_200[384];        /**< \brief 200, \internal Reserved */
    Ifx_SRC_SRCR MCS[4][8];                 /**< \brief 380, GTM MCS Shared Service Request */
    unsigned char reserved_400[384];        /**< \brief 400, \internal Reserved */
    Ifx_SRC_SRCR TOM[3][8];                 /**< \brief 580, GTM TOM Shared Service Request */
    unsigned char reserved_5E0[416];        /**< \brief 5E0, \internal Reserved */
    Ifx_SRC_SRCR ATOM[5][4];                /**< \brief 780, GTM ATOM Shared Service Request */
    unsigned char reserved_7D0[304];        /**< \brief 7D0, \internal Reserved */
    Ifx_SRC_SRCR MCSW0[2];                  /**< \brief 900, GTM Multi Channel Sequencer 0 Service Request */
    Ifx_SRC_SRCR MCSW1[2];                  /**< \brief 908, GTM Multi Channel Sequencer 1 Service Request */
    Ifx_SRC_SRCR MCSW2[2];                  /**< \brief 910, GTM Multi Channel Sequencer 2 Service Request */
    Ifx_SRC_SRCR MCSW3[2];                  /**< \brief 918, GTM Multi Channel Sequencer 2 Service Request */
} Ifx_SRC_GTM;

/** \\brief  HSCT Service requests */
typedef volatile struct _Ifx_SRC_HSCT
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, HSCT Service Request */
} Ifx_SRC_HSCT;

/** \\brief  HSM Service requests */
typedef volatile struct _Ifx_SRC_HSM
{
    Ifx_SRC_SRCR HSM[2];                    /**< \brief 0, HSM Service Request */
} Ifx_SRC_HSM;

/** \\brief  HSSL Service requests */
typedef volatile struct _Ifx_SRC_HSSL
{
    Ifx_SRC_SRCR COK;                       /**< \brief 0, Channel OK Service Request m */
    Ifx_SRC_SRCR RDI;                       /**< \brief 4, Channel Read Data Service Request m */
    Ifx_SRC_SRCR ERR;                       /**< \brief 8, Channel Error ServiceRequest m */
    Ifx_SRC_SRCR TRG;                       /**< \brief C, Channel Trigger Service Request m */
} Ifx_SRC_HSSL;

/** \\brief  I2C Service requests */
typedef volatile struct _Ifx_SRC_I2C
{
    Ifx_SRC_SRCR BREQ;                      /**< \brief 0, I2C Burst Data Transfer Request */
    Ifx_SRC_SRCR LBREQ;                     /**< \brief 4, I2C Last Burst Data Transfer Service Request */
    Ifx_SRC_SRCR SREQ;                      /**< \brief 8, I2C Single Data Transfer Service Request */
    Ifx_SRC_SRCR LSREQ;                     /**< \brief C, I2C Last Single Data Transfer Service Request */
    Ifx_SRC_SRCR ERR;                       /**< \brief 10, I2C Error Service Request */
    Ifx_SRC_SRCR P;                         /**< \brief 14, I2C Kernel Service Request */
    unsigned char reserved_18[56];          /**< \brief 18, \internal Reserved */
} Ifx_SRC_I2C;

/** \\brief  LMU Service requests */
typedef volatile struct _Ifx_SRC_LMU
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, LMU Service Request */
} Ifx_SRC_LMU;

